from discord.ext import commands
import discord


class Help(commands.Cog):
    @commands.slash_command(description="Список команд бота")
    async def help(self, ctx: discord.ApplicationContext) -> None:
        embed = discord.Embed(title="Help command | Список команд", description="**Bot has slash and text commands. You can try it for `/command` and `!command`**", color=0xff0000)
        embed.add_field(name="📚 | Архив", value=
                        "`/archive add` – позволяет записать историческое событие в единый архив"
                        "\n`/archive remove` – позволяет удалить запись из архива", inline=False)
        embed.add_field(name="🪜 | Бот", value=
                        "`/bot` – позволяет узнать информацию о боте"
                        "\n`/ping` – позволяет узнать задержку бота в миллисекундах", inline=False)
        embed.add_field(name="📊 | Статистика", value=
                        "`/country` – информация о стране игрока"
                        "\n`/countries` – список зарегистрированных стран"
                        "\n`/profile` – позволяет узнать посмотреть профиль пользователя"
                        "\n`/logs` – вывод последних 10-и строк из логов бота", inline=False)
        embed.add_field(name="🗂 | Страны и регистрация", value=
                        "`/registration` - регистрация участника за страну"
                        "\n`/unregistration` - снять участника со страны"
                        "\n`/country` - информация о стране пользователя"
                        "\n`/countires` - список всех стран", inline=False)
        embed.add_field(name="💰 | Экономика", value='`!reg <ВВП номинал> <резерв страны> <госдолг>` зарегистрировать свою валюту\n`!check <id>` посмотреть курс указанного сервера\n`!set <id> <население>` установить население для сервера\n`!checkall` посмотреть курсы всех серверов\n`!servall` посмотреть все сервера\n`!sanctions_add <id>` установить санкции для сервера\n`!sanctions_remove <id>` снять санкции с сервера\n')
        await ctx.respond(embed=embed)
            
def setup(bot:commands.Bot) -> None:
    bot.add_cog(Help(bot))